'''3) Реализовать функцию my_func(), которая принимает.
 три позиционных аргумента, и возвращает сумму наибольших двух аргументов '''
a = (10, 20, 7)
print(a)
b = sorted(a)
print(b)
addition = b[1] + b[2]
print(addition)
